#!/usr/bin/env python3
# -*- coding: utf-8 -*-

VERSION = "0.01.000"
RELEASE = "BOIDAE"
AUTHOR = "R3v4N's 0wL"

class C:
    BLACK = "\033[30m"
    RED = "\033[31m"
    GREEN = "\033[32m"
    YELLOW = "\033[33m"
    BLUE = "\033[34m"
    MAGENTA = "\033[35m"
    CYAN = "\033[36m"
    WHITE = "\033[37m"
    GRAY = "\033[90m"

    BRIGHT_RED = "\033[91m"
    BRIGHT_GREEN = "\033[92m"
    BRIGHT_YELLOW = "\033[93m"

    BG_BLACK="\033[40m"
    BG_RED="\033[41m"
    BG_GREEN="\033[42m"
    BG_YELLOW="\033[43m"
    BG_BLUE="\033[44m"
    BG_MAGENTA="\033[45m"
    BG_CYAN="\033[46m"
    BG_WHITE="\033[47m"
    BG_GRAY="\033[100m"
    BG_BRIGHT_RED="\033[101m"

    BOLD = "\033[1m"
    RESET = "\033[0m"

def ascii_banner():
    return f"""{C.BG_BLACK}{C.RED}
         ██████╗ ██╗    ██╗██╗         ██████╗ ██╗   ██╗ ██████╗ ██████╗ ███████╗
        ██╔═████╗██║    ██║██║         ██╔══██╗╚██╗ ██╔╝██╔═══██╗██╔══██╗██╔════╝
        ██║██╔██║██║ █╗ ██║██║         ██████╔╝ ╚████╔╝ ██║   ██║██████╔╝███████╗
        ████╔╝██║██║███╗██║██║         ██╔═══╝   ╚██╔╝  ██║   ██║██╔═══╝ ╚════██║
        ╚██████╔╝╚███╔███╔╝███████╗    ██║        ██║   ╚██████╔╝██║     ███████║   
         ╚═════╝  ╚══╝╚══╝ ╚══════╝    ╚═╝        ╚═╝    ╚═════╝ ╚═╝     ╚══════╝
    {C.RESET}"""
